{
  "intro":
  {
    "title":
      "Intro",
    "description":
      "The vets always suggest that pet owners take their cats/dogs to health checks once or twice a year. However, it is easy to forget the time, and they may also ignore this because they look healthy and energetic."
  },
  "question":
  {
    "title":
      "Question",
    "content":
      "How might we encourage pet owners to take their cats/dogs to health checks periodically?"
  },
  "stats":
  {
    "title":
      "Stats",
    "description":
      "I wanted to know how pet owners reminded themselves to take their cats/dogs to the vet for health checks and started a questionnaire from November 2021.",
    "respond":
    {
      "affix":
        "Pet Owners",
      "findings":
      [
        {
          "count":
            43,
          "affix":
            "of them took their cats/dogs to health checks within a week after seeing the reminder."
        },
        {
          "count":
            15,
          "affix":
            "of them didn’t take their cats/dogs to health checks periodically."
        },
        {
          "count":
            24,
          "affix":
            "of them are interested in the service about health check for their cats/dogs."
        }
      ]
    }
  },
  "who":
  {
    "title":
      "Who May Use the Service?",
    "alt":
      "Min-An and her two cats, Seven and Eleven.",
    "description":
      "Min-An has been raising two cats, Seven and Eleven since she was an undergrad student. They are by her side whether she took exams or had interviews, and they are 10 and 9 years old now.",
    "understanding":
    {
      "title":
        "Basic Understanding",
      "description":
        "As the vets suggested, she knew that the health checks for old cats should be twice a year."
    },
    "negligence":
    {
      "title":
        "Negligence",
      "description":
        "Min-An didn’t have the budget for taking Seven and Eleven to health checks when she was a student. They still look healthy and energetic when 7-year-old and above. Therefore, she didn’t do so."
    },
    "incentive":
    {
      "title":
        "Incentive",
      "description":
        "Seven started to be sick this year. Min-An took her to the animal hospital many times and recalled what the vets suggested. One of her new year resolutions is to take them to health checks periodically."
    }
  },
  "why":
  {
    "title":
      "Why Does She Use the Service?",
    "coverAlt":
      "Google Calendar, iOS Calendar, Fantastical, Things, Spark, and more. She has so many choices.",
    "description":
    {
      "1st":
        "There have been a lot of calendar and reminder apps, and Min-An doesn’t need another one. What kind of notifications which she doesn’t expect to ignore? Billing notifications are one of them. Carrier Express charges her periodically, and she will get receipt emails.",
      "2nd":
        "Making an appointment is available one week before the scheduled payment. It’s her commitment to Seven and Eleven’s health as a responsible pet owner."
    }
  },
  "flow":
  {
    "title":
      "What Are the Steps Before She Makes an Appointment?",
    "alt":
      "Onboarding flow of Carrier Express"
  },
  "mvp":
  {
    "title":
      "Getting Started as a Minimum Viable Product",
    "paragraphs":
    [
      {
        "title":
          "For Cat Owners",
        "description":
          "The frequency which bringing cats and dogs to health checks is the same."
      },
      {
        "title":
          "One Animal Hospital",
        "description":
          "According to the survey, most pet owners have their favorite animal hospital."
      },
      {
        "title":
          "Payment by Credit Card",
        "description":
          "Recurring payment by credit card is mature. "
      }
    ]
  },
  "prototype":
  {
    "title":
      "Give It a Try",
    "appoint":
    {
      "title":
        "Make an Appointment",
      "alt":
        "Min-An makes an appointment for Eleven.",
      "description":
        "Min-An makes an appointment for Eleven on Carrier Express."
    }
  },
  "screenshot":
  {
    "title":
      "Take a Closer Look",
    "subtitle":
      "What does the service look like on an iPad or laptop?",
    "description":
      "Alternatively, Min-An could make appointments on her laptop.",
    "alt":
      "Min-An makes an appointment at her laptop."
  },
  "postmark":
  {
    "description":
      "The <a class=\"paragraph-link\" href=\"https://thenounproject.com/icon/cat-3037142\" target=\"_blank\" rel=\"noopener\">Cat Icon</a> is created by <a class=\"paragraph-link\" href=\"https://thenounproject.com/coquet_adrien\" target=\"_blank\" rel=\"noopener\">Adrien Coquet</a> from The Noun Project."
  }
}
