{
  "intro":
  {
    "title":
      "Intro",
    "description":
      "The vets always suggest that pet owners take their furry friends to health checks once or twice a year. However, it is easy to forget the time, and they may also ignore this because they look healthy and energetic."
  },
  "question":
  {
    "title":
      "Question",
    "content":
      "How might we encourage pet owners to take their furry friends to health checks periodically?"
  },
  "stats":
  {
    "title":
      "Stats",
    "description":
      "I wanted to know how pet owners reminded themselves to take their furry friends to the vet for health checks and started a questionnaire from November 2021.",
    "respond":
    {
      "affix":
        "Pet Owners",
      "findings":
      [
        {
          "count":
            41,
          "affix":
            "of them took their furry friends to health checks within a week after seeing the reminder."
        },
        {
          "count":
            14,
          "affix":
            "of them didn’t take their furry friends to health checks periodically."
        },
        {
          "count":
            24,
          "affix":
            "of them are interested in the service about health check for their furry friends."
        }
      ]
    }
  },
  "idea":
  {
    "title":
      "Idea",
    "description":
    [
      {
        "paragraph":
          "There have been a lot of calendar and reminder apps, and pet owners probably don’t need another one. What kind of notifications which most people don’t expect to ignore? Billing notifications are one of them."
      },
      {
        "paragraph":
          "Since it has been charging the pet owners, they can make a health check appointment anytime."
      }
    ]
  },
  "status":
  {
    "title":
      "Project Status",
    "description":
      "The questionnaire is still open. Meanwhile, I set up a preview landing page and collect search terms on the health checks of dogs and cats. The visitors can leave their emails if the concept interests them."
  },
  "postmark":
  {
    "description":
      "The <a class=\"paragraph-link\" href=\"https://thenounproject.com/icon/cat-3037142\" target=\"_blank\" rel=\"noopener\">Cat Icon</a> is created by <a class=\"paragraph-link\" href=\"https://thenounproject.com/coquet_adrien\" target=\"_blank\" rel=\"noopener\">Adrien Coquet</a> from The Noun Project."
  }
}
