{
  "abtest":
  {
    "intro":
    {
      "title":
        "Intro",
      "description":
        "iCook is the largest recipe community in Taiwan. At iCook, everyone’s questions to the product had the chance to challenge current designs or content by A/B tests. It results from working closely with front-end and back-end developers to redesign UI components."
    },
    "problemTechnical":
    {
      "title":
        "The Technical Problem",
      "description":
        "iCook started as a desktop-only website and hit product-market fit around 2010. There were a lot of workarounds to be mobile-friendly, and updating a piece of the interfaces had the chance to break something. The product and marketing team often proposed UI experiments as the concept of design systems went popular. However, the difficulties of replacing some parts of the webpages limited the ideas."
    },
    "prerequisite":
    {
      "title":
        "Prerequisites for Building UI Components",
      "description":
        "Knowing developer’s workflows and tools was essential for untying the workarounds.",
      "htmlcss":
        "Organized naming convention in CSS enabled the appearance of UI components to be independent.",
      "git":
        "I accessed the codebase and used Git workflows in GitHub like the developers."
    },
    "abtesting":
    {
      "title":
        "A/B Testing Recipes Recommendation",
      "description":
        "We designed “Recipes Recommendation” to assume the content that visitors wanted to read more about the recipe. I put different data sets into the UI component I have built, and we could start an A/B test."
    },
    "problemProduct":
    {
      "title":
        "The Problem",
      "description":
        "Most of the visitors from search engines reached only 1 recipe in iCook and left."
    },
    "question":
    {
      "title":
        "Question",
      "description":
        "How Might We Recommend the Recipes which the Visitors Want to Read Further?"
    },
    "current":
    {
      "title":
        "Current Strategy",
      "description":
        "iCook picked 3 recipes from the same context or category for every recipe. For example, the dishes for late-night supper or seafood."
    },
    "outcome":
    {
      "title":
        "The Outcome",
      "description":
        "The total clicks for <strong>the same dish</strong> are up to 3 times as many as those with <strong>the same context</strong>."
    },
    "groups":
    {
      "title":
        "Test Groups",
      "description":
        "What kind of recipes did the visitors reaching “<a class=\"paragraph-link\" href=\"https://icook.tw/recipes/101777\" target=\"_blank\" rel=\"noopener\">Wine-boiled Clams within 5 Minutes</a>” want to browse next?",
      "or":
        "or",
      "cover":
        "Recipe: Wine-boiled Clams within 5 Minutes",
      "control":
      {
        "title":
          "Same Context",
        "description":
          "The recipes of the dishes from 🍶izakayas or 🍻stir-fries restaurants"
      },
      "experiment":
      {
        "title":
          "Similar Dishes",
        "description":
          "More recipes for “Wine-boiled clams.”"
      }
    },
    "dig":
    {
      "title":
        "Digging Into it",
      "description":
        "If it was the steps and ingredients that many people did, they were confident completing it. Therefore, the same dish by different authors triggered them to click."
    },
    "impact":
    {
      "title":
        "Impact",
      "description":
        "The data engineer developed an algorithm based on recipe names and instructions."
    },
    "learned":
    {
      "title":
        "What I Have Learned",
      "data":
      {
        "title":
          "Required and Optional Data, and Their Types",
        "description":
          "Well-documented UI components indicate the following data situations:",
        "items":
        {
          "first":
            "Required or optional",
          "second":
            "Text, number, or true/false, etc."
        }
      },
      "tag":
      {
        "title":
          "The Rules of Release Tags",
        "description":
          "“<a class=\"paragraph-link\" href=\"https://semver.org\" target=\"_blank\" rel=\"noopener\">Semantic Versioning</a>” in software development is the communication bridge among developers. It is easy to know why the update existed and what to be careful of."
      }
    }
  }
}
