{
  "intro":
    "In general, applications for work should be productive because of their repetitive usage. I will explore fluent UI design and its feasibility with the clock-in project.",
  "why":
  {
    "title":
      "The Problem",
    "problem":
      "The company I worked for was using an app with clock-in, leave statistics, and salary information features. One had to go back to the dashboard as he&sol;she switched between features in that clock-in app.",
    "opinion":
      "In my opinion, a fluent UI flow is like climbing up or walking down the stairs to reach a goal. I decided to redesign the clock-in app since I would never know how the original app was created."
  },
  "questions":
  {
    "title":
      "Questions",
    "flat":
    {
      "title":
        "Flattened Structure",
      "question":
        "How might we increase productivity while some of performance would be sacrificed?"
    },
    "back":
    {
      "title":
        "Avoid Pressing &ldquo;Back&rdquo;",
      "question":
        "How might we switch among screens smoothly without the need of going back to a &ldquo;main menu&rdquo;?"
    }
  },
  "document":
  {
    "title":
      "Documenting",
    "items":
    [
      {
        "name":
          "Onboarding",
        "description":
          "We work as a remote team. The members get started with <a class=\"paragraph-link\" href=\"https://www.craft.do/s/WPp0S5oPecqEPc\" data-splitbee-event=\"Pie Document: Onboarding\" target=\"_blank\" rel=\"noopener\">Onboarding</a>."
      },
      {
        "name":
          "Why &amp; How",
        "description":
          "Product specification is subject to change. We write down WHY the roles we defined are using a clock-in app and HOW they are going to fulfill their goals."
      }
    ]
  },
  "note":
  {
    "title":
      "Notable Discussions",
    "items":
    [
      {
        "name":
          "Limited Resources for a Side Project",
        "description":
          "There are many tasks to  accomplish accoring to Roles &amp; Goals. We are moving towards a complete UI flow at the moment due to the scarce time &amp; resources of a side project."
      }
    ]
  }
}