{
  "brief":
  {
    "title":
      "Brief",
    "description":
      "Applications for work should be productive because of their repetitive usage. Compared to the product in use, the major flows of the clock-in app: Pie are going to be simpler. I do UI ideation of the side project on my own and have prepared an onboarding document for future members."
  },
  "why":
  {
    "title":
      "The Problem",
    "problem":
      "The company I worked for was using an app with clock-in, leave statistics, and salary information features. One had to go back to the &ldquo;Main Menu&rdquo; as he&sol;she switched between features in the product in use. The flow could be simplified."
  },
  "question":
  {
    "title":
      "Question",
    "content":
      "How might we simplify the flows of the routine tasks?"
  },
  "flows":
  {
    "title":
      "Flows Comparison",
    "inuse":
      "App in Use",
    "mainmenu":
      "Main Menu",
    "clockin":
      "Clock In&sol;Out",
    "clockin_done":
      "Clocked In&sol;Out",
    "clockin_withConfirm":
      "{{clockin}} + {{confirmform}}",
    "confirmform":
      "Confirm Leave Forms",
    "confirmform_done":
      "Finish Confirming",
    "screen":
      "{{view}} Screen",
    "description":
      "&ldquo;Main Menu&rdquo; is not required for completing routine tasks. There will be &ldquo;going-back-and-forths&rdquo; if a user has more than one thing to do in the product in use. The Tab Bar at screen bottom comes to the flow&rsquo;s rescue."
  },
  "document":
  {
    "title":
      "Documentation",
    "items":
    [
      {
        "name":
          "Onboarding",
        "description":
          "To work as a remote team, the members who will join the project get started with <a class=\"paragraph-link\" href=\"https://www.craft.do/s/WPp0S5oPecqEPc\" data-splitbee-event=\"Pie Document: Onboarding\" target=\"_blank\" rel=\"noopener\">Onboarding</a>."
      },
      {
        "name":
          "Why &amp; How",
        "description":
          "Product specification is subject to change. We write down WHY the roles we defined are using a clock-in app and HOW they are going to fulfill their goals."
      }
    ]
  },
  "note":
  {
    "title":
      "Notable Discussions",
    "items":
    [
      {
        "name":
          "Limited Resources for a Side Project",
        "description":
          "There are many tasks to accomplish accoring to Roles &amp; Goals. The project is moving towards a complete UI flow at the moment due to the scarce time &amp; resources."
      }
    ]
  }
}