{
  "brief":
  {
    "title":
      "Brief",
    "description":
      "Applications for work should be productive because of their repetitive usage. Compared to the product in use, the major flows of the clock-in app: Pie are going to be simpler."
  },
  "why":
  {
    "title":
      "The Problem",
    "problem":
      "The company I worked for was using an app with clock-in, leave statistics, and salary information features. One had to go back to the dashboard as he&sol;she switched between features in that clock-in app.",
    "opinion":
      "In my opinion, a fluent UI flow is like climbing up or walking down the stairs to reach goals. The flow of the product in use could be simplified."
  },
  "question":
  {
    "title":
      "Question",
    "content":
      "How might we simplify the flows of the routine taks?"
  },
  "flows":
  {
    "title":
      "Flows",
    "inuse":
      "App In Use",
    "mainmenu":
      "Main Menu",
    "clockinout":
      "Clock-In/Out",
    "screen":
      "Screen",
    "description":
      "&rdquo;Main Menu&ldquo; is not required for completing routine tasks. This can be done with the Tab Bar at the bottom.",
    "another":
      "There will be another &rdquo;Going Back and Forth&ldquo; if a user has something else to do in the product in use."
  },
  "document":
  {
    "title":
      "Documenting",
    "items":
    [
      {
        "name":
          "Onboarding",
        "description":
          "We work as a remote team. The members get started with <a class=\"paragraph-link\" href=\"https://www.craft.do/s/WPp0S5oPecqEPc\" data-splitbee-event=\"Pie Document: Onboarding\" target=\"_blank\" rel=\"noopener\">Onboarding</a>."
      },
      {
        "name":
          "Why &amp; How",
        "description":
          "Product specification is subject to change. We write down WHY the roles we defined are using a clock-in app and HOW they are going to fulfill their goals."
      }
    ]
  },
  "note":
  {
    "title":
      "Notable Discussions",
    "items":
    [
      {
        "name":
          "Limited Resources for a Side Project",
        "description":
          "There are many tasks to  accomplish accoring to Roles &amp; Goals. We are moving towards a complete UI flow at the moment due to the scarce time &amp; resources of a side project."
      }
    ]
  }
}